	 *> Hello World
00100  IDENTIFICATION DIVISION.
00200  PROGRAM-ID. hello.
00300  PROCEDURE DIVISION.
00400  DISPLAY "Hello World!",
00500  STOP RUN.
